[M_YouDontKnowJack MissionDefinition]
MissionDescription="Mordecai likes to get to know someone before he kills them. To this end, he's sent you to [place]Arid Nexus[-place] to collect whatever information you can about Handsome Jack's rise to power."
MissionSummary="Find audio footage of Handsome Jack's rise to power."

[M_YouDontKnowJack:Journal1 MissionObjectiveDefinition]
ProgressMessage="Find first Jack ECHO"

[M_YouDontKnowJack:Journal2 MissionObjectiveDefinition]
ProgressMessage="Find second Jack ECHO"

[M_YouDontKnowJack:Journal3 MissionObjectiveDefinition]
ProgressMessage="Find third Jack ECHO"

[M_YouDontKnowJack:Journal4 MissionObjectiveDefinition]
ProgressMessage="Find fourth Jack ECHO"

[M_YouDontKnowJack:Journal5 MissionObjectiveDefinition]
ProgressMessage="Find fifth Jack ECHO"
